FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ЦеныАвторабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныАвторабот</Name>
			<Comment>Цены авторабот</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Нормочас</Name>
					<Comment>Нормочас</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Comment>Авторабота</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Comment>Цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРемонта</Name>
					<Comment>Вид ремонта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>В регистре хранятся курсы валют по дням</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>Курс валюты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>Кратность валюты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ПрименяемостьДополнительныхПредложенийПоМоделям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрименяемостьДополнительныхПредложенийПоМоделям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Comment>Используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДополнительноеПредложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Comment>GUID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ИзменениеЦенАвторабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ИзменениеЦенАвторабот</Name>
			<Comment>Изменение цен авторабот компании и контрагентов</Comment>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>InformationRegister.ЦеныАвторабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонта</Name>
					<Comment>Вид ремонта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Comment>Цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик товара, для которого регистрируются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата начала действия цены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Устанавливаемый тип цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Comment>Дата операции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Автоработы</Name>
					<Comment>Автоработы цены которых надо изменить</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Авторабота</Name>
							<Comment>Авторабота</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нормочас</Name>
							<Comment>Нормочас</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Новая цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/Нормочасы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Нормочасы</Name>
			<Comment>Нормочасы авторабот</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта нормочаса</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена нормочаса</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ЦеныАвторабот/Ext/RecordSetModule.bsl
Перем ДокументОбъект Экспорт;        // Документ объект
Перем ДоговорВзаиморасчетов Экспорт; // Договор взаимо расчетов
Перем ТипЦен Экспорт;                // Тип цен работ
Перем ВидРемонта Экспорт;            // Вид ремонта
Перем Цех Экспорт;                   // Цех
Перем ДатаНачалаДействия Экспорт;    // Дата начала действий

Перем РезультатЗапросаПоАвтоработам Экспорт; // РезультатЗапроса или ТаблицаЗначений. Устанавливается если документ имеет "необычную" ТЧ

// получаем таблицу авторабот и их цен
Функция ПолучитьТаблицуАвторабот()
	
	МетаданныеИмя = ДокументОбъект.Метаданные().Имя;
	
	Запрос=Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаАвторабот.Авторабота КАК Авторабота,
	|	ТаблицаАвторабот.Модель КАК Модель
	|ПОМЕСТИТЬ
	|	ТаблицаАвторабот
	|ИЗ
	|	Документ."+МетаданныеИмя+".Автоработы КАК ТаблицаАвторабот
	|ГДЕ
	|	Ссылка = &Ссылка
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументАвтоработы.Авторабота.Код КАК Код,
	|	ДокументАвтоработы.Авторабота.Артикул КАК Артикул,
	|	ДокументАвтоработы.Авторабота КАК Авторабота,
	|	ДокументАвтоработы.Модель КАК Модель,
	|	ДокументАвтоработы.Нормочас КАК Нормочас,
	|	ДокументАвтоработы.Цена КАК Цена,
	|	ЕСТЬNULL(ЦеныАвтоработВБазе.Нормочас, &НормочасПустой) КАК НормочасВБазе,
	|	ЕСТЬNULL(ЦеныАвтоработВБазе.Валюта,   &ВалютаПустая) КАК ВалютаВБазе,
	|	ЕСТЬNULL(ЦеныАвтоработВБазе.Цена,     0) КАК ЦенаВБазе
	|ИЗ
	|	Документ."+МетаданныеИмя+".Автоработы КАК ДокументАвтоработы
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныАвторабот.СрезПоследних(&Момент,
	|			ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов И 
	|			ТипЦен = &ТипЦен И 
	|			Цех = &Цех И 
	|			ВидРемонта = &ВидРемонта И 
	|			(Авторабота, Модель) В (ВЫБРАТЬ Авторабота, Модель ИЗ ТаблицаАвторабот)
	|	) КАК ЦеныАвтоработВБазе
	|ПО
	|	ДокументАвтоработы.Модель                = ЦеныАвтоработВБазе.Модель И 
	|	ДокументАвтоработы.Авторабота            = ЦеныАвтоработВБазе.Авторабота И 
	|	ЦеныАвтоработВБазе.ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов И 
	|	ЦеныАвтоработВБазе.ТипЦен                = &ТипЦен И 
	|	ЦеныАвтоработВБазе.Цех                   = &Цех И 
	|	ЦеныАвтоработВБазе.ВидРемонта            = &ВидРемонта
	|ГДЕ
	|	(ДокументАвтоработы.Ссылка = &Ссылка)
	|");
	Запрос.УстановитьПараметр("Ссылка",                ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("Момент",                ДатаНачалаДействия);
	Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", ДоговорВзаиморасчетов);
	Запрос.УстановитьПараметр("ТипЦен",                ТипЦен);
	Запрос.УстановитьПараметр("Цех",                   Цех);
	Запрос.УстановитьПараметр("ВидРемонта",            ВидРемонта);
	Запрос.УстановитьПараметр("НормочасПустой",        Справочники.Нормочасы.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВалютаПустая",          Справочники.Валюты.ПустаяСсылка());
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// устанавливает цены
Функция УстановитьЦеныАвторабот() Экспорт
	
	// получаем таблицу цен
	Если (РезультатЗапросаПоАвтоработам=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоАвтоработам)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоАвтоработам)<>Тип("ТаблицаЗначений")) Тогда
		РезультатЗапросаПоАвтоработам=ПолучитьТаблицуАвторабот();
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоАвтоработам)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоАвтоработам=РезультатЗапросаПоАвтоработам.Выгрузить();
	КонецЕсли;
	
	СообщатьОбИзменении=обПраво("СообщатьОбИзмененииЦен",ДокументОбъект.Права,,ДокументОбъект);
	
	//ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	//СтруктураКурса=обКурсДляВалюты(ВалютаРегл,ДокументОбъект.Дата);
	//КурсРегл=СтруктураКурса.Курс/?(СтруктураКурса.Кратность=0,1,СтруктураКурса.Кратность);
	
	ВалютаТипаЦен = ТипЦен.ВалютаЦены;
	ВВалютеУчета  = ТипЦен.ВВалютеУчета;
	//СтрВалютаТипаЦен = СокрЛП(ВалютаТипаЦен.Наименование);
	КурсВалютыТипаЦен = 0;
	ТаблицаКурсов = Новый ТаблицаЗначений;
	Если ВВалютеУчета Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КурсыВалют.Валюта,
		|	МАКСИМУМ(КурсыВалют.Период) КАК Период
		|ПОМЕСТИТЬ
		|	ТаблицаВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ГДЕ
		|	КурсыВалют.Период <= &НаДату
		|СГРУППИРОВАТЬ ПО
		|	КурсыВалют.Валюта
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаВалют.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА КурсыВалют.Кратность = 0 ТОГДА
		|			КурсыВалют.Курс
		|		ИНАЧЕ
		|			КурсыВалют.Курс/КурсыВалют.Кратность
		|	КОНЕЦ КАК Курс
		|ИЗ
		|	ТаблицаВалют КАК ТаблицаВалют
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ПО
		|	ТаблицаВалют.Валюта = КурсыВалют.Валюта И 
		|	ТаблицаВалют.Период = КурсыВалют.Период
		|";
		Запрос.УстановитьПараметр("НаДату", ДокументОбъект.Дата);
		ТаблицаКурсов = Запрос.Выполнить().Выгрузить();
		ТаблицаКурсов.Индексы.Добавить("Валюта");
	Иначе
		СтруктураКурса    = обКурсДляВалюты(ВалютаТипаЦен, ДокументОбъект.Дата);
		КурсВалютыТипаЦен = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	КонецЕсли;
	
	// устанавливаем цены
	Для Каждого СтрокаАвторабот Из РезультатЗапросаПоАвтоработам Цикл
		НоваяЦена   = 0;
		Если НЕ обЗначениеНеЗаполнено(СтрокаАвторабот.Нормочас) Тогда
			Если СтрокаАвторабот.Нормочас = СтрокаАвторабот.НормочасВБазе Тогда
				Продолжить;
			КонецЕсли;
		ИначеЕсли НЕ обЗначениеНеЗаполнено(СтрокаАвторабот.Цена) Тогда
			Если ВВалютеУчета Тогда
				ВалютаТипаЦен = СтрокаАвторабот.Авторабота.Номенклатура.ВалютаУчета;
				СтрокаКурсВалюта = ТаблицаКурсов.Найти(ВалютаТипаЦен, "Валюта");
				КурсВалютыТипаЦен = 1;
				Если НЕ СтрокаКурсВалюта = Неопределено Тогда
					КурсВалютыТипаЦен = СтрокаКурсВалюта.Курс;
				КонецЕсли;
			КонецЕсли;
			
			НоваяЦена = Окр(обПересчет(СтрокаАвторабот.Цена, ДокументОбъект.ВалютаДокумента, ДокументОбъект.КурсДокумента, ВалютаТипаЦен, КурсВалютыТипаЦен), 2);
			
			Если ВалютаТипаЦен = СтрокаАвторабот.ВалютаВБазе И НоваяЦена = СтрокаАвторабот.ЦенаВБазе Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяЗапись = Добавить();
		НоваяЗапись.Период = ДатаНачалаДействия;
		НоваяЗапись.Регистратор = ДокументОбъект.Ссылка;
		НоваяЗапись.Модель                = СтрокаАвторабот.Модель;
		НоваяЗапись.Авторабота            = СтрокаАвторабот.Авторабота;
		НоваяЗапись.ДоговорВзаиморасчетов = ДоговорВзаиморасчетов;
		НоваяЗапись.ТипЦен                = ТипЦен;
		НоваяЗапись.Цех                   = Цех;
		НоваяЗапись.ВидРемонта            = ВидРемонта;
		Если ЗначениеЗаполнено(СтрокаАвторабот.Нормочас) Тогда
			НоваяЗапись.Нормочас = СтрокаАвторабот.Нормочас;
		ИначеЕсли ЗначениеЗаполнено(НоваяЦена) Тогда
			НоваяЗапись.Валюта   = ВалютаТипаЦен;
			НоваяЗапись.Цена     = НоваяЦена;
		КонецЕсли; 

		//// сообщим, если надо
		//Если СообщатьОбИзменении Тогда
		//	Если НЕ обЗначениеНеЗаполнено(СтрокаАвторабот.НормочасВБазе) Тогда
		//		СообщениеЦенаСтарая="Старая цена: "+СтрокаАвторабот.НормочасВБазе+".";
		//	ИначеЕсли НЕ обЗначениеНеЗаполнено(СтрокаАвторабот.ВалютаВБазе) И НЕ обЗначениеНеЗаполнено(
		//	СтрокаАвторабот.ЦенаВБазе) Тогда
		//		СообщениеЦенаСтарая="Старая цена: "+Формат(СтрокаАвторабот.ЦенаВБазе,"ЧДЦ=2;
		//		ЧН=0,00")+" "+СтрокаАвторабот.ВалютаВБазе+".";
		//	Иначе
		//		СообщениеЦенаСтарая="";
		//	КонецЕсли; 
		//	Если НЕ обЗначениеНеЗаполнено(НоваяЗапись.НормочасВБазе) Тогда
		//		СообщениеЦенаНовая="Новая цена: "+НоваяЗапись.Нормочас+".";
		//	ИначеЕсли НЕ обЗначениеНеЗаполнено(НоваяЗапись.Валюта) И НЕ обЗначениеНеЗаполнено(НоваяЗапись.Цена) Тогда
		//		СообщениеЦенаНовая="Новая цена: "+Формат(НоваяЗапись.Цена,"ЧДЦ=2; ЧН=0,00")+" "+НоваяЗапись.Валюта+".";
		//	Иначе
		//		СообщениеЦенаНовая="Новая цена: <неопределено>";
		//	КонецЕсли; 
		//	дкСообщитьРезультат("["+СокрЛП(СтрокаАвторабот.Артикул)+"] """
		//	+СокрЛП(СтрокаАвторабот.Авторабота)+"""."+СообщениеЦенаСтарая+" "+СообщениеЦенаНовая" Тип цен: "
		//	+СтрТипЦен+?(обЗначениеНеЗаполнено(Контрагент),""," Контрагент: "+СокрЛП(Контрагент.Наименование)),
		//	"Информация&Изменение цен:",ДокументОбъект,СтрокаТовар.Номенклатура);
		//КонецЕсли;
	КонецЦикла;
	
	// скинем переменные
	ДоговорВзаиморасчетов         = Неопределено;
	ТипЦен                        = Неопределено;
	Цех                           = Неопределено;
	ВидРемонта                    = Неопределено;
	ДатаНачалаДействия            = Неопределено;
	РезультатЗапросаПоАвтоработам = Неопределено;
	// убиваем циклическую ссылку
	ДокументОбъект                = Неопределено;
	
	Возврат Истина;
	
КонецФункции

// Предопределенная процедура
Процедура ПриЗаписи(Отказ, Замещение)
	// Зарегистрируем изменения для узлов РБД
	орРегистрацияИзменений(ЭтотОбъект);
	
	// зарегистрируем изменения для обмена с моб устр.
	РегистраторСсылка = Этотобъект.Отбор.Регистратор.Значение;
	Если ЗначениеЗаполнено(РегистраторСсылка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИзменениеЦенАвтоработАвтоработы.Авторабота
		|ПОМЕСТИТЬ ТабДокумента
		|ИЗ
		|	Документ.ИзменениеЦенАвторабот.Автоработы КАК ИзменениеЦенАвтоработАвтоработы
		|ГДЕ
		|	ИзменениеЦенАвтоработАвтоработы.Ссылка = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Автоработы.Ссылка КАК ДопПредложение
		|ПОМЕСТИТЬ ДопПредложения
		|ИЗ
		|	Справочник.Автоработы КАК Автоработы
		|ГДЕ
		|	Автоработы.ЭтоГруппа = ЛОЖЬ
		|	И Автоработы.ЭтоДополнительноеПредложение = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДопПредложения.ДопПредложение
		|ПОМЕСТИТЬ ИзменДопродажи
		|ИЗ
		|	ДопПредложения КАК ДопПредложения
		|ГДЕ
		|	(ДопПредложения.ДопПредложение В
		|				(ВЫБРАТЬ
		|					ТабДокумента.Авторабота
		|				ИЗ
		|					ТабДокумента КАК ТабДокумента)
		|			ИЛИ ДопПредложения.ДопПредложение В ИЕРАРХИИ
		|				(ВЫБРАТЬ
		|					ТабДокумента.Авторабота
		|				ИЗ
		|					ТабДокумента КАК ТабДокумента))
		|
		|СГРУППИРОВАТЬ ПО
		|	ДопПредложения.ДопПредложение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзменДопродажи.ДопПредложение КАК ДополнительноеПредложение,
		|	ЕСТЬNULL(ПрименяемостьДополнительныхПредложенийПоМоделям.Модель, ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)) КАК Модель,
		|	ЕСТЬNULL(ПрименяемостьДополнительныхПредложенийПоМоделям.GUID, """") КАК guid
		|ИЗ
		|	ИзменДопродажи КАК ИзменДопродажи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрименяемостьДополнительныхПредложенийПоМоделям КАК ПрименяемостьДополнительныхПредложенийПоМоделям
		|		ПО ИзменДопродажи.ДопПредложение = ПрименяемостьДополнительныхПредложенийПоМоделям.ДополнительноеПредложение";
		
		Запрос.УстановитьПараметр("Регистратор", РегистраторСсылка);
		
		Выборка = Запрос.Выполнить().Выбрать(); Наборы = Новый Массив;
		Пока Выборка.Следующий() Цикл
			Набор = РегистрыСведений.ПрименяемостьДополнительныхПредложенийПоМоделям.СоздатьНаборЗаписей();
			Набор.Отбор.ДополнительноеПредложение.Установить(Выборка.ДополнительноеПредложение);
			Набор.Отбор.Модель.Установить(Выборка.Модель);
			Набор.Отбор.GUID.Установить(Выборка.guid);
			
			Наборы.Добавить(Набор);
		КонецЦикла;
		
		// внесем изменения в план обмена
		ПланыОбмена.ОбменСМобильнымУстройством.ЗарегистрироватьИзмененияДляУзла(Наборы);
	КонецЕсли;
КонецПроцедуры	//	ПриЗаписи()
